<?php
/**
 * @desc API Response codes
 * 返回码（描述）  
 */
return array(
  //0-599:系统内部（或http）公共返回码
  '0' => 'Success',
  '1' => 'Failure',
  '400' => 'Not Found',
  '403' => '未登录或无权访问',
  '404' => '错误的http请求', 
  '500' => '系统错误, 请稍后再试', 
  
  //600-999:API公共返回码
  '600' => '网络超时，请稍后再试', 
  '601' => 'client不存在或非法',
  '701' => '微信支付签名错误',
  '702' => '微信支付下单失败',
  
  //1000-1999:APP返回码
  '1000' => '缺少参数 (mobile, passwd 或 mcode)', 
  '1001' => '缺少参数 (mobile 或 passwd)',
  '1002' => '缺少参数 (openid 或 access_token)',
  '1003' => '缺少参数 (sina_uid 或 access_token)',
  '1004' => '缺少参数 (unionid, openid 或 access_token)',
  '1005' => '参数 openid 错误或不合法',
  '1006' => '缺少参数 (category)',
  '1007' => '缺少参数 (tid 或 content)',
  '1008' => '不能回复自己',
  '1009' => '缺少参数 (tid)',
  '1010' => '缺少参数 (tid 或 pid)',
  '1011' => '缺少参数 (type 或 mcode)',
  '1012' => '缺少参数 (passwd)',
  '1013' => '缺少参数 (content 或 contact_info)',
  '1014' => '',
  '1015' => '缺少参数 (category 或 content)',

  //1020-1040
  '1020' => '缺少参数 (gid)',
  '1021' => '获取或生成游戏房间失败',
  '1022' => '缺少参数 (roomid)',
  '1023' => '房间已解散或房间已开始游戏',
  '1024' => '添加玩家到房间失败',
  '1025' => '获取房间玩家数据失败',
  '1026' => '房间状态与接口请求不一致',
  '1027' => '玩家退出房间失败',
  '1028' => '房间状态',
  '1029' => '房间已解散或房间未开始游戏',
  '1030' => '游戏已经结束',
  '1031' => '添加游戏状态失败',
  '1032' => '卧底猜词错误',
  '1033' => '缺少参数 (words_id 或 type)',
  '1034' => '房间已解散',
  '1035' => '该用户不在房间中',
);
